ABET-Server/udp.echoString.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
 xmlns:ns="urn:gsoap-udp-demo">
 <SOAP-ENV:Header>
  <wsa:MessageID></wsa:MessageID>
  <wsa:To></wsa:To>
  <wsa:Action></wsa:Action>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <ns:echoString>
   <str></str>
  </ns:echoString>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
